#coding:utf-8

contests = [[], [], []]

contests[0] = ["清华大学", 
"北京师范大学", 
"华南理工大学", 
"中山大学", 
"华中师范大学", 
"复旦大学", 
"北京航空航天大学", 
"湖南大学", 
"广东工业大学", 
"南京大学", 
"华中科技大学", 
"中国科学院大学", 
"北京理工大学", 
"中南大学", 
"重庆邮电大学", 
"西安电子科技大学", 
"浙江工业大学", 
"杭州电子科技大学", 
"大连理工大学软件学院", 
"西安交通大学", 
"同济大学", 
"中国地质大学（北京）", 
"东北大学", 
"山东理工大学", 
"电子科技大学", 
"山东大学", 
"武汉大学", 
"重庆大学", 
"山东科技大学", 
"天津大学", 
"四川大学", 
"北京交通大学", 
"哈尔滨工业大学", 
"合肥工业大学", 
"浙江理工大学", 
"福州大学", 
"吉林大学", 
"长春工业大学", 
"北京邮电大学", 
"南京邮电大学", 
"郑州轻工业学院", 
"广州大学", 
"中国人民解放军信息工程大学", 
"成都信息工程大学", 
"东北林业大学"]

contests[1] = ["电子科技大学", 
"浙江大学", 
"上海交通大学", 
"北京邮电大学", 
"北京理工大学", 
"华中师范大学", 
"国防科技大学", 
"中山大学", 
"武汉大学", 
"华东师范大学", 
"北京大学", 
"广东工业大学", 
"大连理工大学", 
"北京师范大学", 
"武汉理工大学", 
"重庆大学", 
"北京航空航天大学", 
"南京大学", 
"上海大学", 
"福建农林大学", 
"北京交通大学", 
"山东理工大学", 
"天津大学", 
"南京邮电大学", 
"华南理工大学", 
"西安电子科技大学", 
"浙江师范大学", 
"吉林大学", 
"南阳理工学院", 
"中国科学院大学", 
"南京理工大学", 
"哈尔滨工业大学", 
"西南民族大学", 
"河南工业大学", 
"中国矿业大学", 
"合肥工业大学", 
"福州大学", 
"浙江财经大学", 
"复旦大学", 
"苏州大学", 
"河南大学", 
"华中科技大学", 
"西北农林科技大学", 
"山东大学", 
"河海大学"]

contests[2] = ["清华大学", 
"复旦大学", 
"上海交通大学", 
"华南理工大学", 
"国防科技大学", 
"福州大学", 
"浙江大学", 
"北京航空航天大学", 
"武汉大学", 
"上海大学", 
"中国科学院大学", 
"浙江大学城市学院", 
"长沙理工大学", 
"杭州电子科技大学", 
"南京大学", 
"苏州大学", 
"中山大学", 
"天津大学", 
"北京大学", 
"北京邮电大学", 
"吉首大学", 
"浙江师范大学", 
"南京航空航天大学", 
"北京理工大学", 
"华中师范大学", 
"浙江理工大学", 
"南阳理工学院", 
"哈尔滨工业大学", 
"中国科学技术大学", 
"河南工业大学", 
"西安电子科技大学", 
"西北工业大学", 
"深圳大学", 
"华南农业大学", 
"山东大学", 
"浙江工业大学", 
"哈尔滨工程大学", 
"长春理工大学", 
"华东师范大学", 
"重庆大学", 
"武汉科技大学", 
"合肥工业大学", 
"杭州电子科技大学信息工程学院", 
"中南大学", 
"大连理工大学"]

l = []
index = [0 for x in range(len(contests))]
def merge():
    total = 80
    cas = 0
    unhit = 0
    useup = 0
    while total > 0 and useup < len(contests):
        for (i, contest) in zip(range(len(contests)), contests):
            if(index[i] < len(contests[i])):
                if(l.count(contest[index[i]]) == 0):
                    l.append(contest[index[i]])
                    total -= 1
                    cas += 1
                else:
                    unhit += 1
                index[i] += 1
            else:
                useup += 1
    print "unhit", unhit
merge()
i = 0
for x in l:
    print "{} : {}".format(i, l[i])
    i+=1

    